# Cancellable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitEventArgs..::..Cancellable Property
RevitEventArgs Class See Also
---
Indicates whether an event may be cancelled by an event delegate.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Cancellable { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Cancellable As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool Cancellable {
	bool get ();
}
```

# Remarks
If 'Cancellable' is true, event delegates may cancel the command that was announced by the event. To do so, a delegate would set the 'Cancel' property to True. Typically, post-events (e.g. DocumentPrinted) are not cancellable, while most pre-events (e.g. DocumentPrinting) are cancellable, except for special conditions and situations, such as when the Revit application is being closed or if an event is raised during another event.
# See Also
RevitEventArgs Class
Autodesk.Revit.DB.Events Namespace